# Дан одномерный массив числовых значений, насчитывающий N элементов.
# Добавить столько элементов, чтобы элементов с положительными и отрицательными значениями стало бы поровну.

def create_array(array):
 positive_count= 0
 negative_count= 0
 for element in array:
  if element <0:
   negative_count += 1
  if element >0:
   positive_count += 1
 count= positive_count - negative_count
 if count >0:
  for i in range (count):
   array.append (-10)
 if count <0:
  for i in range (count):
   array.append (10)
 return array
array = [2,1,0,-1,3,4,-2,4]
print (create_array(array))
